'''企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高 
　　　于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可可提 
　　　成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于 
　　　40万元的部分，可提成3%；60万到100万之间时，高于60万元的部分，可提成1.5%，高于 
　　　100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？ '''
def interest(i):
    bonus1 = 100000*0.1 #10w
    bonus2 = bonus1 + 100000*0.075 #20w
    bonus3 = bonus2 +200000*0.05  #40w
    bonus4 = bonus3 + 200000*0.03 #60w
    bonus5 = bonus4 + 400000*0.015 #100w
    if i <= 0:
        bonus = 0
        
    elif i<=100000:
        bonus = i*0.1
    
    elif i<= 200000:
        bonus = bonus1+(i-100000)*0.075

    elif i <= 400000:
        bonus = bonus2+(i-200000)*0.05

    elif i <= 600000:
        bonus = bonus3+(i-400000)*0.03

    elif i <= 1000000:
        bonus = bonus4+(i-600000)*0.015

    else:
        bonus = bonus5+(i-1000000)*0.01
    return bonus
i= int(input('请输入你的利润：'))
print('你的提成是%d' %interest(i))

        
